backend/app/controllers/api/v1/tasks_controller.rb

SELECT "tasks".* FROM "tasks" WHERE (title ILIKE '%test%' OR description ILIKE '%test%') ORDER BY created_at desc LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "tasks"
---
  def index
    @tasks = Task.all

    # Applica filtri e ricerca
    @tasks = apply_filters(@tasks)
    @tasks = apply_search(@tasks)
    @tasks = apply_sorting(@tasks)

    # Paginazione
    @tasks = @tasks.page(params[:page]).per(params[:per_page] || 10)

    render json: {
      tasks: @tasks.map { |task| task_json(task, include_search_highlights: search_params[:q].present?) },
      meta: pagination_meta(@tasks),
      filters: applied_filters_summary

INSERT INTO "tasks" ("title", "description", "completed", "created_at", "updated_at") VALUES ('Atque exercitationem consequuntur recusandae Sapiente ducimus ut fugiat enim non laboris enim facilis omnis earum', 'Aut ad perspiciatis tempor enim in', FALSE, '2025-06-10 14:43:47.324735', '2025-06-10 14:43:47.324735') RETURNING "id"
---
  def create
    @task = Task.new(task_params)

    if @task.save

UPDATE "tasks" SET "title" = 'Configurare environment di ssss', "updated_at" = '2025-06-10 15:22:04.308451' WHERE "tasks"."id" = 17
---
  def update
    if @task.update(task_params)